INSERT INTO salary_admin_v3.salary_archive (employee_id,version,latest_flag,effective_date,expiry_date,audit_status,base_salary,probation_base_salary,currency,change_reason,tax_rule_code,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (6,1,0,'2024-04-14','2024-04-30',1,42000.00000000,0.00000000,'CNY','入职薪资档案','NO_TAX','',0,'system','2026-04-06 14:53:57','system','2026-04-07 06:40:42'),
	 (6,2,0,'2024-05-01','2024-10-31',1,42000.00000000,0.00000000,'CNY','添加全勤奖','NO_TAX','',0,'system','2026-04-07 14:37:35','system','2026-04-08 03:40:22'),
	 (6,3,0,'2024-11-01','2025-08-31',1,5840.00000000,0.00000000,'USDT','2024年11月薪资结算调整','NO_TAX','',0,'system','2026-04-08 11:40:11','system','2026-04-08 07:07:00'),
	 (6,4,1,'2025-09-01','9999-12-31',1,7008.00000000,0.00000000,'USDT','2025年薪资调整','NO_TAX','',0,'system','2026-04-08 15:06:48','system','2026-04-08 07:07:00'),
	 (5,1,0,'2024-04-01','2024-10-31',1,45000.00000000,0.00000000,'CNY','2024年4月薪资档案','TAX_RESIDENT_CN','',0,'system','2026-04-08 15:47:28','system','2026-04-08 07:49:51'),
	 (5,2,0,'2024-11-01','2024-11-30',1,6250.00000000,0.00000000,'USDT','2024年11月薪资结算调整','TAX_RESIDENT_CN','',0,'system','2026-04-08 15:49:34','system','2026-04-08 08:18:08'),
	 (5,3,0,'2024-12-01','2025-03-31',1,6250.00000000,0.00000000,'USDT','2024年薪资档案调整','TAX_RESIDENT_CN','',0,'system','2026-04-08 16:18:01','system','2026-04-08 09:24:21'),
	 (5,4,0,'2025-04-01','2026-02-28',1,6250.00000000,0.00000000,'USDT','薪资档案变动','TAX_RESIDENT_CN','',0,'system','2026-04-08 17:23:22','system','2026-04-14 04:03:25'),
	 (7,1,0,'2024-04-26','2024-10-31',1,40000.00000000,0.00000000,'CNY','2024年入职薪资','TAX_RESIDENT_CN','',0,'system','2026-04-10 15:03:53','system','2026-04-10 07:04:57'),
	 (7,2,0,'2024-11-01','2025-03-31',1,5560.00000000,0.00000000,'USDT','2024年11月薪资调整','TAX_RESIDENT_CN','',0,'system','2026-04-10 15:04:49','system','2026-04-10 10:53:33');
INSERT INTO salary_admin_v3.salary_archive (employee_id,version,latest_flag,effective_date,expiry_date,audit_status,base_salary,probation_base_salary,currency,change_reason,tax_rule_code,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (6,5,0,'2025-04-01','9999-12-31',2,7008.00000000,0.00000000,'USDT','2025年4月薪资调整','NO_TAX','1',0,'system','2026-04-10 18:52:12','system','2026-04-10 10:52:43'),
	 (7,3,0,'2025-04-01','2026-01-31',1,5560.00000000,0.00000000,'USDT','2025年4月薪资档案调整','TAX_RESIDENT_CN','',0,'system','2026-04-10 18:53:23','system','2026-04-11 04:24:52'),
	 (7,4,0,'2026-02-01','2026-02-01',1,6672.00000000,0.00000000,'USDT','2026年2月薪资调整','TAX_RESIDENT_CN','',0,'system','2026-04-11 12:24:42','system','2026-04-14 03:50:26'),
	 (8,1,1,'2024-11-01','9999-12-31',1,4170.00000000,0.00000000,'USDT','2024年11月薪资档案调整','TAX_RESIDENT_CN','',0,'system','2026-04-11 14:09:28','system','2026-04-11 14:09:28'),
	 (7,5,1,'2026-02-02','9999-12-31',1,6672.00000000,0.00000000,'USDT','测试调整','TAX_RESIDENT_CN','',0,'system','2026-04-14 11:50:15','system','2026-04-14 03:50:26'),
	 (5,5,1,'2026-03-01','9999-12-31',1,7500.00000000,0.00000000,'USDT','测试调整','TAX_RESIDENT_CN','',0,'system','2026-04-14 12:01:26','system','2026-04-14 04:03:30');
