INSERT INTO salary_admin.salary_deduction_detail (period_id,employee_id,deduction_type_id,deduction_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (2,1,4,'水电网扣款','行政罚款','CNY',134.11000000,1.00000000,134.11,'CNY','2024年5月水电网扣款',0,'admin','2026-03-19 11:39:48','admin','2026-03-19 11:55:30'),
	 (3,1,4,'水电网扣款','行政罚款','CNY',5.62000000,1.00000000,5.62,'CNY','2024年6月份水电网扣费',0,'admin','2026-03-19 15:59:20','admin','2026-03-19 15:59:20'),
	 (4,1,7,'本月押金','行政罚款','CNY',2000.00000000,1.00000000,2000.00,'CNY','2024年7月 本月押金',0,'admin','2026-03-19 17:30:18','admin','2026-03-19 17:30:18'),
	 (5,1,8,'各类罚款','行政罚款','CNY',1273.89000000,1.00000000,1273.89,'CNY','2024年8月各类罚款',0,'admin','2026-03-19 17:36:19','admin','2026-03-19 17:36:19'),
	 (5,1,7,'本月押金','行政罚款','CNY',2000.00000000,1.00000000,2000.00,'CNY','2024年 8月本月押金',0,'admin','2026-03-19 17:37:04','admin','2026-03-19 17:37:04'),
	 (6,1,7,'本月押金','行政罚款','CNY',2000.00000000,1.00000000,2000.00,'CNY','2024年9月本月押金',0,'admin','2026-03-19 17:54:08','admin','2026-03-19 17:54:08'),
	 (6,1,4,'水电网扣款','行政罚款','CNY',6.82000000,1.00000000,6.82,'CNY','2024年9月水电网扣款',0,'admin','2026-03-19 17:55:00','admin','2026-03-19 17:55:00'),
	 (7,1,7,'本月押金','行政罚款','CNY',2000.00000000,1.00000000,2000.00,'CNY','2024年10月本月押金',0,'admin','2026-03-19 18:22:00','admin','2026-03-19 18:22:00'),
	 (8,1,7,'本月押金','行政罚款','USDT',439.83000000,1.00000000,439.83,'USDT','2024年11月本月押金扣除',0,'admin','2026-03-23 15:24:25','admin','2026-03-23 15:28:00'),
	 (9,1,8,'各类罚款','行政罚款','USDT',40.00000000,1.00000000,40.00,'USDT','2024年12月40U未知扣款',0,'admin','2026-03-23 15:29:45','admin','2026-03-23 15:29:45');
