INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (3,1,23,'欧洲杯激励奖金','专项奖金','CNY',21000.00000000,1.00000000,21000.00,'CNY','2024年6月欧洲杯激励奖金',0,'admin','2026-03-19 15:53:43','admin','2026-03-19 15:53:43'),
	 (3,1,24,'端午节值班福利','考勤相关','CNY',2800.00000000,1.00000000,2800.00,'CNY','2024年6月份端午节福利',0,'admin','2026-03-19 15:55:06','admin','2026-03-19 15:55:06'),
	 (3,1,25,'端午节礼金','津贴福利','PHP',5000.00000000,0.12578600,628.93,'CNY','2024年6月份端午节礼金',0,'admin','2026-03-19 16:04:34','admin','2026-03-19 08:36:07'),
	 (4,1,23,'欧洲杯激励奖金','专项奖金','CNY',21000.00000000,1.00000000,21000.00,'CNY','2024年7月欧洲杯奖励',0,'admin','2026-03-19 17:28:09','admin','2026-03-19 17:28:09'),
	 (4,1,2,'KPI绩效','绩效奖金','CNY',8400.00000000,1.00000000,8400.00,'CNY','2024年7月B级KPI绩效',0,'admin','2026-03-19 17:29:23','admin','2026-03-19 17:29:23'),
	 (5,1,2,'KPI绩效','绩效奖金','CNY',21000.00000000,1.00000000,21000.00,'CNY','2024年8月A级KPI绩效',0,'admin','2026-03-19 17:33:28','admin','2026-03-19 17:33:28'),
	 (5,1,3,'外宿房补','津贴补贴','CNY',1614.96000000,1.00000000,1614.96,'CNY','2024年8月外宿房补',0,'admin','2026-03-19 17:34:52','admin','2026-03-19 17:34:52'),
	 (6,1,2,'KPI绩效','绩效奖金','CNY',8400.00000000,1.00000000,8400.00,'CNY','2024年9月B级KPI绩效',0,'admin','2026-03-19 17:41:48','admin','2026-03-19 17:41:48'),
	 (6,1,3,'外宿房补','津贴补贴','CNY',2292.99000000,1.00000000,2292.99,'CNY','2024年九月外宿房补',0,'admin','2026-03-19 17:42:45','admin','2026-03-19 17:42:45'),
	 (6,1,19,'中秋节值班福利','考勤相关','CNY',2800.00000000,1.00000000,2800.00,'CNY','2024年9月中秋节值班福利',0,'admin','2026-03-19 17:43:38','admin','2026-03-19 17:43:38');
INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (6,1,20,'中秋节礼金','津贴福利','PHP',5000.00000000,0.12739000,636.95,'CNY','2024年中秋节礼金',0,'admin','2026-03-19 17:49:47','admin','2026-03-19 09:51:28'),
	 (7,1,2,'KPI绩效','绩效奖金','CNY',21000.00000000,1.00000000,21000.00,'CNY','2024年10月份 B级KPI绩效',0,'admin','2026-03-19 18:19:26','admin','2026-03-19 18:19:26'),
	 (7,1,3,'外宿房补','津贴补贴','CNY',2018.00000000,1.00000000,2018.00,'CNY','2024年10月份外宿房补',0,'admin','2026-03-19 18:20:44','admin','2026-03-19 18:20:44'),
	 (8,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2024年11月KPI绩效',0,'admin','2026-03-23 11:08:22','admin','2026-03-23 03:39:43'),
	 (8,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2024年11月外宿房补',0,'admin','2026-03-23 11:08:54','admin','2026-03-23 03:39:43'),
	 (9,1,2,'KPI绩效','绩效奖金','USDT',2920.00000000,1.00000000,2920.00,'USDT','2024年12月KPI绩效A级',0,'admin','2026-03-23 13:10:56','admin','2026-03-23 13:10:56'),
	 (9,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2024年12月外宿房补',0,'admin','2026-03-23 13:11:35','admin','2026-03-23 13:11:35'),
	 (10,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2025年1月KPI绩效B级',0,'admin','2026-03-23 14:13:32','admin','2026-03-23 14:13:32'),
	 (10,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年1月外宿房补',0,'admin','2026-03-23 14:14:16','admin','2026-03-23 14:14:16'),
	 (11,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2025年2月KPI绩效B级',0,'admin','2026-03-23 14:15:43','admin','2026-03-23 14:15:43');
INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (11,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年2月外宿房补',0,'admin','2026-03-23 14:16:41','admin','2026-03-23 14:16:41'),
	 (12,1,2,'KPI绩效','绩效奖金','USDT',2920.00000000,1.00000000,2920.00,'USDT','2025年3月KPI绩效A级',0,'admin','2026-03-23 14:17:26','admin','2026-03-23 15:02:43'),
	 (12,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年3月外宿房补',0,'admin','2026-03-23 14:17:58','admin','2026-03-23 14:17:58'),
	 (13,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2025年4月KPI绩效B级',0,'admin','2026-03-23 14:18:55','admin','2026-03-23 14:20:24'),
	 (13,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年4月外宿房补',0,'admin','2026-03-23 14:19:32','admin','2026-03-23 14:20:16'),
	 (14,1,2,'KPI绩效','绩效奖金','USDT',2920.00000000,1.00000000,2920.00,'USDT','2025年5月绩效A级',0,'admin','2026-03-23 14:21:24','admin','2026-03-23 15:14:17'),
	 (14,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年5月外宿补贴',0,'admin','2026-03-23 14:22:27','admin','2026-03-23 14:22:27'),
	 (15,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2025年6月KPI绩效B级',0,'admin','2026-03-23 14:23:47','admin','2026-03-23 14:23:47'),
	 (15,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年外宿房补',0,'admin','2026-03-23 14:24:37','admin','2026-03-23 14:24:37'),
	 (16,1,2,'KPI绩效','绩效奖金','USDT',2920.00000000,1.00000000,2920.00,'USDT','2025年07月KPI绩效A级',0,'admin','2026-03-23 14:26:39','admin','2026-03-23 14:36:32');
INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (16,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年7月外宿房补',0,'admin','2026-03-23 14:27:13','admin','2026-03-23 14:27:13'),
	 (17,1,2,'KPI绩效','绩效奖金','USDT',1168.00000000,1.00000000,1168.00,'USDT','2025年8月KPI绩效B级',0,'admin','2026-03-23 14:30:23','admin','2026-03-23 14:30:23'),
	 (17,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年8月外宿房补',0,'admin','2026-03-23 14:34:56','admin','2026-03-23 14:34:56'),
	 (14,1,24,'端午节值班福利','考勤相关','USDT',376.77000000,1.00000000,376.77,'USDT','2025年5月端午节值班福利',0,'admin','2026-03-23 17:06:52','admin','2026-03-23 17:08:01'),
	 (14,1,26,'本月返还','专项奖金','USDT',420.00000000,1.00000000,420.00,'USDT','2025年5月本月返还420',0,'admin','2026-03-23 17:11:02','admin','2026-03-23 17:11:02'),
	 (14,1,25,'端午节礼金','津贴福利','USDT',180.00000000,1.00000000,180.00,'USDT','2025年端午节礼金',0,'admin','2026-03-23 17:12:37','admin','2026-03-23 17:12:37'),
	 (15,1,26,'本月返还','专项奖金','USDT',420.00000000,1.00000000,420.00,'USDT','2025年6月本月返还',0,'admin','2026-03-23 17:15:28','admin','2026-03-23 17:15:28'),
	 (16,1,26,'本月返还','专项奖金','USDT',560.00000000,1.00000000,560.00,'USDT','本月返还',0,'admin','2026-03-23 17:19:35','admin','2026-03-23 17:19:35'),
	 (17,1,27,'上月补发','考勤相关','USDT',859.05000000,1.00000000,859.05,'USDT','2025年8月上月补发续扣',0,'admin','2026-03-23 17:23:44','admin','2026-03-23 17:23:44'),
	 (18,1,2,'KPI绩效','绩效奖金','USDT',1401.60000000,1.00000000,1401.60,'USDT','2025年9月KPI绩效B级',0,'admin','2026-03-23 18:53:27','admin','2026-03-23 18:56:14');
INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (18,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年9月外宿房补',0,'admin','2026-03-23 18:54:04','admin','2026-03-23 18:54:04'),
	 (19,1,2,'KPI绩效','绩效奖金','USDT',3504.00000000,1.00000000,3504.00,'USDT','2025年10月KPI绩效A',0,'admin','2026-03-23 18:58:16','admin','2026-03-23 18:58:16'),
	 (19,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年10月外宿房补',0,'admin','2026-03-23 18:58:47','admin','2026-03-23 18:58:47'),
	 (19,1,17,'年假奖金','专项奖金','USDT',1500.00000000,1.00000000,1500.00,'USDT','2025年10月年假奖金',0,'admin','2026-03-24 03:17:29','admin','2026-03-24 03:17:29'),
	 (19,1,20,'中秋节礼金','津贴福利','USDT',180.00000000,1.00000000,180.00,'USDT','2025年10月中秋节礼金',0,'admin','2026-03-24 03:18:14','admin','2026-03-24 03:18:14'),
	 (19,1,19,'中秋节值班福利','考勤相关','USDT',452.13000000,1.00000000,452.13,'USDT','2025年10月中秋节福利',0,'admin','2026-03-24 03:19:28','admin','2026-03-24 03:19:28'),
	 (20,1,2,'KPI绩效','绩效奖金','USDT',1401.60000000,1.00000000,1401.60,'USDT','2025年11月KPI绩效B级',0,'admin','2026-03-24 03:22:58','admin','2026-03-24 03:22:58'),
	 (20,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年11月外宿房补',0,'admin','2026-03-24 03:23:39','admin','2026-03-24 03:23:39'),
	 (21,1,2,'KPI绩效','绩效奖金','USDT',3504.00000000,1.00000000,3504.00,'USDT','2025年12月KPI绩效A级',0,'admin','2026-03-24 03:26:27','admin','2026-03-24 03:26:27'),
	 (21,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2025年12月外宿房补',0,'admin','2026-03-24 03:26:58','admin','2026-03-24 03:26:58');
INSERT INTO salary_admin.salary_income_detail (period_id,employee_id,income_type_id,income_type_name,category_name,currency,original_amount,exchange_rate,amount,settlement_currency,remark,delete_flag,create_by,create_time,update_by,update_time) VALUES
	 (22,1,2,'KPI绩效','绩效奖金','USDT',1401.60000000,1.00000000,1401.60,'USDT','2026年1月KPI绩效B级',0,'admin','2026-03-24 03:29:19','admin','2026-03-24 03:29:19'),
	 (22,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2026年1月外宿房补',0,'admin','2026-03-24 03:30:03','admin','2026-03-24 03:30:03'),
	 (22,1,6,'春节礼金','津贴福利','USDT',300.00000000,1.00000000,300.00,'USDT','2026年1月春节礼金',0,'admin','2026-03-24 03:31:28','admin','2026-03-24 03:31:28'),
	 (23,1,7,'年终奖13薪','专项奖金','USDT',7008.00000000,1.00000000,7008.00,'USDT','2026年2月年终奖13薪',0,'admin','2026-03-24 03:35:12','admin','2026-03-24 03:35:12'),
	 (23,1,2,'KPI绩效','绩效奖金','USDT',3504.00000000,1.00000000,3504.00,'USDT','2026年2月KPI绩效A级',0,'admin','2026-03-24 03:35:48','admin','2026-03-24 03:35:48'),
	 (23,1,3,'外宿房补','津贴补贴','USDT',300.00000000,1.00000000,300.00,'USDT','2026年2月外宿房补',0,'admin','2026-03-24 03:36:17','admin','2026-03-24 03:36:17'),
	 (23,1,5,'春节值班双薪','加班考勤','USDT',1752.00000000,1.00000000,1752.00,'USDT','2026年2月7天春节值班双薪',0,'admin','2026-03-24 03:38:20','admin','2026-03-24 03:38:20');
